<html>
<head>
	<link rel = 'icon' type = 'image/x-icon' href = 'ACM_logo.png'>
	<link rel = 'stylesheet' type = 'text/css' href = 'style.css'>
	<link rel = 'stylesheet' type = 'text/css' href = 'menu.css'>
	<meta http-equiv = 'content-type' content = 'text/html' charset = 'utf-8'>
	<title>Головна</title>
</head>
<body>
<?php
$root = '.';
include 'common/menu.php';
dbConnect();
$tmp = mysql_query('SELECT count(*) FROM tasks');
$task_num = mysql_fetch_array($tmp)[0];
?>
	<div class = 'content'>
<p>Сайт створений (командою групи ІС-41, ФІОТ, перший курс – Халимоном Тарасом, Ботвинко Дар’єю, Сердюком Євгенієм) з метою підготовки  студентів і всіх бажаючих підвищити свої навички у програмуванні до олімпіад із вищезгаданого предмету різного рівня. Після проходження повного комплексного курсу підготовки до оліпміад із програмування, ви навчитеся <i>розпізнавати теми</i> даних вам задач, зможете правильно <i>аналізувати умову</i> та робити висновки щодо можливості <i>застосування того чи іншого алгоритму у розв’язанні задачі</i>.</p>
<p>Сайт побудований у вигляді т<i>ренажеру</i>, тобто ви маєте змогу спробувати розв’язати низку реальних задач, взятих із міжнародної олімпіади АСМ (2011 – 2014 років) та KPI-Open 2015 року. Після цього, ви можете відправити код розв’язаної задачі у форматі cpp-файлу на сайт, у розділі “Завдання” (оберіть певне завдання та перейдіть на його сторінку - <a href='http://77.47.239.14:8080/rgr/tasks/'>Завдання</a>. </p>
<p>У разі невдалої спроби, ви можете впевнено почати <i>комплексну підготовку</i> до розв’язування подібних задач. Таким чином, ви маєте можливість переглядати <i>теорію</i> до найважливіших тем, задачі до яких зазвичай даються на олімпіадах із програмування різного рівня - <a href='http://77.47.239.14:8080/rgr/theory'>Теорія</a>.</p>
<p>Далі можете пройти підготовку у розділі <i>онлайн-курсу</i>, де ви знайдете візуалізацію основних і найпоширеніших алгоритмів розв’язання типових олімпіадних задач - <a href='http://77.47.239.14:8080/rgr/cource'>Онлайн курс</a>.</p>

<br><i>Навігація: </i>
<p>- Для перегляду всіх наявних завдань перейдіть сюди;</p>
<p>- Для перегляду теорії – сюди;</p>
<p>- Для проходження онлайн-курсу – сюди;</p>
<p>- Для зв’язку з розробниками – сюди.</p>

<style>
.rightimg
{
	float: right;
	margin: 7px 0 7px 7px;
}
</style>

<center><img src = http://77.47.239.14/cursach/res/acm_logo.png class=”rightimg”></center>

<p><b>Міжнародна олімпіада АСМ</b> – це щорічне змагання з програмування між університетами всього світу. Генеральний спонсор заходу -- IBM. Штаб-квартира – в університеті Бейлор.</p>
<p>Була заснована ще у 1970 році Техаським університетом.</p>
<p><b>Правила: </b></p>
<p><i>АСМ</i> – це командне змагання. Кожна команда складається з трьох людей. Учасники мають бути студентами університету, які провчилися хоча б 5 років на момент початку змагань. <br>Студенти, що раніше брали участь у двох Фіналах Світу, або п’яти регіональних змаганнях АСМ, не мають права на участь в олімпіаді знов.</p>
<p>Протягом змагання студентам надано 5 годин на розв’язання 8-12 задач із програмування. Вони мають бути розв’язані на С, С++, або Java. Програми тестуються на великій кількості тестів, якщо вона проходить кожен із них, команді нараховуються бали, вона продовжує працювати над іншими задачами.</p>


<p><center><img src = 'http://77.47.239.14/cursach/res/acm.jpg'></center></p>
<p>Для більш детальної інформації перейдіть за посиланнями:</p>
<p>Головна сторінка офіційного сайту АСМ <b> (ACM International Collegiate Programming Contest) </b>  - <a href='http://icpc.baylor.edu'>ACM</a></p>
<p>Інформація про АСМ, “Чемпионат мира по программированию ACM ICPC 2013 в Санкт-Петербурге” -  <a href='http://habrahabr.ru/company/yandex/blog/185394'>Чімпіонат</a></p>
	</div>
</body>
</html>